Merge pull request #2 from QuxKit/docs/11-npm-readme
Docs/11 npm readme
